import React, { useState } from "react";
import styles from "./Footer.module.css";
import { Link } from "react-router-dom";
import law01 from "./../../assets/images/law01.jpg"
import {
  Facebook,
  Instagram,
  LinkedIn,
  Telegram,
  Twitter,
} from "@mui/icons-material";
import FooterCard from "../footerCard/FooterCard";

function Footer() {
 
  return (
    <div className={styles.footerContainer}>
      <footer>
        <div className={styles.waves}>
          <div className={styles.wave} id={styles.wave1}></div>
          <div className={styles.wave} id={styles.wave2}></div>
          <div className={styles.wave} id={styles.wave3}></div>
          <div className={styles.wave} id={styles.wave4}></div>
        </div>

        <ul className={styles.menu} style={{ width: "100%" }}>
          
          <FooterCard src={law01}  firstText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد." secondText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون..." />
          <FooterCard src={law01}  firstText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد." secondText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون..." />
          <FooterCard src={law01}  firstText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد." secondText="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون..." />

         
        </ul>

        <div className="my-3 text-center">
          <span className="h3 text-light ">
            سجاد افخمی نیا در نظر دارد با بروز رسانی در خدمات حقوقی کشور و ارتقاء خدمات وکالتی
            از سیستم سنتی به سبک نوین و همچنین تسهیل و تسریع در ارائه این قبیل
            خدمات به اشخاص (اعم از حقیقی و حقوقی) کمک شایانی به نظام وکالت در سطح استان نماید
          </span>
        </div>

        <h3>
          آدرس : ارومیه, .... ، ابتدای .... ، جنب مجتمع تجاری .... ، پلاک
          ... ، واحد ..{" "}
        </h3>

        <ul className={styles.socialIcon}>
          <li>
            <Link>
              <LinkedIn />
            </Link>
          </li>
          <li>
            <Link>
              <Facebook />
            </Link>
          </li>
          <li>
            <Link>
              <Twitter />
            </Link>
          </li>
          <li>
            <Link>
              <Telegram />
            </Link>
          </li>
          <li>
            <Link>
              <Instagram />
            </Link>
          </li>
        </ul>
        
        <p className="lead">
          {" "}
          2023 Mehdi Janfeshan | all rights reserved&copy;
        </p>
      </footer>
    </div>
  );
}

export default Footer;
